{
  "command.regenerateIcons.title": "Appliquer Icônes Personnalisation",
  "command.ngPreset.title": "Basculer Angular Préréglé (Niveau d'espace de travail)",
  "command.jsPreset.title": "Basculer JS Officiel Préréglé (Niveau de l'utilisateur)",
  "command.tsPreset.title": "Basculer TS Officiel Préréglé (Niveau de l'utilisateur)",
  "command.jsonPreset.title": "Basculer JSON Officiel Préréglé (Niveau de l'utilisateur)",
  "command.hideFoldersPreset.title": "Basculer la visibilité des icônes des dossiers (Niveau de l'utilisateur)",
  "command.restoreIcons.title": "Restaurer le manifeste d'icône par défaut",
  "command.resetProjectDetectionDefaults.title": "Réinitialiser les valeurs par défaut de détection de projet",
  "configuration.title": "vscode-icons configuration",
  "configuration.dontShowNewVersionMessage.description": "Si défini sur true, le message de la nouvelle version ne sera plus affiché.",
  "configuration.projectDetection.autoReload.description": "Si défini sur true, l'extension se redémarrera automatiquement lors de la détection du projet.",
  "configuration.projectDetection.disableDetect.description": "Si défini sur true, l'extension désactive la détection du projet.",
  "configuration.presets.angular.description": "Si défini sur true, l'extension correspondra à certains motifes Angular commun.",
  "configuration.presets.jsOfficial.description": "Si défini sur true, l'extension utilisera l'icône JS officielle.",
  "configuration.presets.tsOfficial.description": "Si défini sur true, l'extension utilisera l'icône TS officielle.",
  "configuration.presets.jsonOfficial.description": "Si défini sur true, l'extension utilisera l'icône JSON officielle.",
  "configuration.presets.hideFolders.description": "Si défini sur true, tous les dossiers seront caché.",
  "configuration.associations.files.description": "Ces associations personnalisées remplacent les associations d'icônes de fichiers définies par défaut.",
  "configuration.associations.folders.description": "Ces associations personnalisées remplacent les associations d'icônes de dossier définies par défaut.",
  "configuration.associations.fileDefault.file.description": "Ce paramètre vous permet de modifier l'icône du fichier foncé par défaut.",
  "configuration.associations.fileDefault.file_light.description": "Ce paramètre vous permet de modifier l'icône du fichier lumineux par défaut.",
  "configuration.associations.folderDefault.folder.description": "Ce paramètre vous permet de modifier l'icône du dossier foncé par défaut.",
  "configuration.associations.folderDefault.folder_light.description": "Ce paramètre vous permet de modifier l'icône du dossier lumineux par défaut."
}
